Repository: xcv58/MacTools
Catalog: Plugins/AIAssistant/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: ar, de, en, es, fr, ja, ko, pt, ru, tr, zh_hant

# settings.prompt.shortcutLabel
source: 全局快捷键
ar: اختصار لوحة مفاتيح عام
de: Globaler Tastaturkurzbefehl
en: Global shortcut
es: Atajo de teclado global
fr: Raccourci clavier global
ja: グローバルショートカット
ko: 전역 단축키
pt: Atalho de teclado global
ru: Глобальное сочетание клавиш
tr: Genel kısayol
zh_hant: 全域快捷鍵

# settings.prompt.shortcutClear
source: 清除快捷键
ar: مسح الاختصار
de: Tastenkombination löschen
en: Clear Shortcut
es: Borrar atajo
fr: Effacer le raccourci
ja: ショートカットを消去
ko: 단축키 지우기
pt: Limpar atalho
ru: Очистить сочетание клавиш
tr: Kısayolu Temizle
zh_hant: 清除快速鍵

# settings.prompt.shortcutDescription
source: 按下快捷键即可使用此模板处理选中文本。
ar: اضغط على الاختصار لمعالجة النص المحدد باستخدام هذا التوجيه.
de: Drücken Sie die Tastenkombination, um den ausgewählten Text mit diesem Prompt zu verarbeiten.
en: Press the shortcut to process selected text with this prompt.
es: Pulsa el atajo de teclado para procesar el texto seleccionado con este prompt.
fr: Appuyez sur le raccourci pour traiter le texte sélectionné avec ce prompt.
ja: このプロンプトで選択したテキストを処理するには、ショートカットを押します。
ko: 이 프롬프트로 선택한 텍스트를 처리하려면 단축키를 누르세요.
pt: Pressione o atalho para processar o texto selecionado com este prompt.
ru: Нажмите сочетание клавиш, чтобы обработать выделенный текст с помощью этого промпта.
tr: Seçili metni bu istemle işlemek için kısayola basın.
zh_hant: 按下快速鍵直接使用此模板處理選取的文字。

# settings.prompt.template.title
source: 提示词模板 (Prompt Template)
ar: قالب التوجيه
de: Prompt-Vorlage
en: Prompt Template
es: Plantilla de prompt
fr: Modèle de prompt
ja: プロンプトテンプレート
ko: 프롬프트 템플릿
pt: Modelo de prompt
ru: Шаблон промпта
tr: İstem Şablonu
zh_hant: 提示詞模板 (Prompt Template)

# settings.prompt.systemPrompt.title
source: 系统提示词 (System Prompt)
ar: توجيه النظام
de: System-Prompt
en: System Prompt
es: Prompt del sistema
fr: Prompt système
ja: システムプロンプト
ko: 시스템 프롬프트
pt: Prompt do sistema
ru: Системный промпт
tr: Sistem İstemi
zh_hant: 系統提示詞 (System Prompt)

# settings.shortcuts.title
source: 快捷键
ar: الاختصارات
de: Tastenkombinationen
en: Shortcuts
es: Atajos
fr: Raccourcis
ja: ショートカット
ko: 단축키
pt: Atalhos
ru: Сочетания клавиш
tr: Kısayollar
zh_hant: 快速鍵

# settings.shortcutInput.title
source: 快捷键输入
ar: إدخال الاختصار
de: Textquelle für Tastenkombinationen
en: Shortcut Input
es: Entrada del atajo de teclado
fr: Entrée de raccourci
ja: ショートカット入力
ko: 단축키 입력
pt: Entrada de atalho
ru: Текст для сочетаний клавиш
tr: Kısayol Girdisi
zh_hant: 快速鍵輸入

# settings.shortcutInput.clipboard.title
source: 使用剪贴板
ar: استخدم الحافظة
de: Zwischenablage verwenden
en: Use Clipboard
es: Usar portapapeles
fr: Utiliser le Presse-papiers
ja: クリップボードを使用する
ko: 클립보드 사용
pt: Usar área de transferência
ru: Использовать буфер обмена
tr: Panoyu Kullan
zh_hant: 使用剪貼簿

# settings.shortcutInput.clipboard.description
source: 优先处理选中文本；未选中且剪贴板未变化时，使用已复制的文本。
ar: تُعطى الأولوية للنص المحدد. إذا لم يُعثر على تحديد وبقيت الحافظة دون تغيير، يُستخدم النص الذي نسخته سابقًا.
de: Ausgewählten Text bevorzugen. Wenn keine Auswahl gefunden wird und die Zwischenablage unverändert bleibt, wird der zuvor kopierte Text verwendet.
en: Prefer selected text. If no selection is found and the clipboard stays unchanged, use the text you copied earlier.
es: Se da prioridad al texto seleccionado. Si no se detecta ninguna selección y el portapapeles no ha cambiado, se usa el texto copiado anteriormente.
fr: Privilégie le texte sélectionné. Si aucune sélection n’est trouvée et que le presse-papiers reste inchangé, utilise le texte que vous avez copié précédemment.
ja: 選択したテキストを優先します。選択範囲が見つからず、クリップボードが変更されない場合は、前にコピーしたテキストを使用します。
ko: 선택한 텍스트를 우선 사용합니다. 선택한 텍스트가 없고 클립보드가 변경되지 않았다면 이전에 복사한 텍스트를 사용합니다.
pt: Prefira texto selecionado. Se nenhuma seleção for encontrada e a área de transferência permanecer inalterada, use o texto que você copiou anteriormente.
ru: Предпочитать выделенный текст. Если выделение не найдено и буфер обмена не изменился, используйте текст, скопированный ранее.
tr: Seçili metin önceliklidir. Bir seçim bulunamazsa ve pano değişmemişse, daha önce kopyaladığınız metin kullanılır.
zh_hant: 優先處理選取的文字；未選取且剪貼簿未變動時，使用已複製的文字。

# settings.shortcut.conflict.system
source: 该快捷键与常用系统操作冲突，请使用包含 ⌥(Option) 或 ⌃(Control) 的组合键。
ar: يتعارض هذا الاختصار مع إجراء شائع في النظام. استخدم تركيبة تتضمن ⌥ (Option) أو ⌃ (Control).
de: Diese Tastenkombination steht im Konflikt mit einer gängigen Systemaktion. Verwenden Sie eine Kombination, die ⌥ (Option) oder ⌃ (Control) enthält.
en: This shortcut conflicts with a common system action. Use a combination that includes ⌥ (Option) or ⌃ (Control).
es: Este atajo de teclado entra en conflicto con una acción habitual del sistema. Usa una combinación que incluya ⌥ (Option) o ⌃ (Control).
fr: Ce raccourci entre en conflit avec une action système courante. Utilisez une combinaison qui inclut ⌥ (Option) ou ⌃ (Contrôle).
ja: このショートカットは一般的なシステム操作と競合します。⌥ (Option) または ⌃ (Control) を含む組み合わせを使用してください。
ko: 이 단축키는 일반적인 시스템 작업과 충돌합니다. ⌥(옵션) 또는 ⌃(컨트롤)이 포함된 조합을 사용하세요.
pt: Este atalho entra em conflito com uma ação comum do sistema. Use uma combinação que inclua ⌥ (Option) ou ⌃ (Control).
ru: Это сочетание клавиш конфликтует с системным действием. Используйте комбинацию с ⌥ (Option) или ⌃ (Control).
tr: Bu kısayol, yaygın bir sistem eylemiyle çakışıyor. ⌥ (Option) veya ⌃ (Control) içeren bir tuş birleşimi kullanın.
zh_hant: 此快速鍵與常用系統操作衝突，請使用包含 ⌥(Option) 或 ⌃(Control) 的組合鍵。

# settings.shortcut.conflict.duplicatePrompt
source: 该快捷键已被模板「%@」占用，请更换其他按键组合。
ar: يستخدم التوجيه «%@» هذا الاختصار بالفعل. اختر تركيبة مختلفة.
de: Diese Tastenkombination wird bereits vom Prompt „%@“ verwendet. Wählen Sie eine andere Kombination.
en: This shortcut is already used by the prompt “%@”. Choose a different combination.
es: El prompt «%@» ya utiliza este atajo de teclado. Elige otra combinación.
fr: Ce raccourci est déjà utilisé par le prompt « %@ ». Choisissez une combinaison différente.
ja: このショートカットはプロンプト「%@」ですでに使用されています。別の組み合わせを選択してください。
ko: 이 단축키는 "%@" 프롬프트에서 이미 사용되었습니다. 다른 조합을 선택하세요.
pt: Este atalho já é utilizado pelo prompt “%@”. Escolha uma combinação diferente.
ru: Это сочетание клавиш уже используется промптом «%@». Выберите другую комбинацию.
tr: Bu kısayol zaten “%@” istemi tarafından kullanılıyor. Farklı bir tuş birleşimi seçin.
zh_hant: 此快速鍵已被模板「%@」佔用，請更換其他按鍵組合。

# settings.promptRow.moveUpHelp
source: 上移
ar: نقل لأعلى
de: Nach oben
en: Move up
es: Subir
fr: Monter
ja: 上に移動
ko: 위로 이동
pt: Subir
ru: Переместить вверх
tr: Yukarı taşı

# settings.promptRow.moveDownHelp
source: 下移
ar: نقل لأسفل
de: Nach unten verschieben
en: Move down
es: Mover hacia abajo
fr: Descendre
ja: 下に移動
ko: 아래로 이동
pt: Mover para baixo
ru: Переместить вниз
tr: Aşağı taşı

# settings.promptRow.deleteHelp
source: 删除
ar: حذف
de: Löschen
en: Delete
es: Eliminar
fr: Supprimer
ja: 削除
ko: 삭제
pt: Excluir
ru: Удалить
tr: Sil
zh_hant: 刪除

# settings.action.restoreDefaults
source: 恢复默认
ar: استعادة الإعدادات الافتراضية
de: Standardeinstellungen wiederherstellen
en: Restore Defaults
es: Restaurar valores predeterminados
fr: Restaurer les paramètres par défaut
ja: デフォルトに戻す
ko: 기본값 복원
pt: Restaurar padrões
ru: Восстановить настройки по умолчанию
tr: Varsayılanları Geri Yükle
zh_hant: 恢復預設

# settings.action.saveService
source: 保存服务设置
ar: حفظ إعدادات الخدمة
de: Diensteinstellungen sichern
en: Save Service Settings
es: Guardar configuración de servicio
fr: Enregistrer les paramètres du service
ja: サービス設定を保存
ko: 서비스 설정 저장
pt: Salvar configurações de serviço
ru: Сохранить настройки службы
tr: Servis Ayarlarını Kaydet
zh_hant: 儲存服務設定

# settings.message.serviceSaved
source: AI 服务已保存
ar: تم حفظ خدمة الذكاء الاصطناعي
de: KI-Dienst gespeichert
en: AI service saved
es: Servicio de IA guardado
fr: Service IA sauvegardé
ja: AI サービスが保存されました
ko: AI 서비스가 저장되었습니다
pt: Serviço de IA salvo
ru: Служба ИИ сохранена.
tr: Yapay zekâ servisi kaydedildi
zh_hant: AI 服務已儲存

# settings.error.noEnabledProvider
source: 至少启用一个 AI 服务。
ar: فعّل خدمة ذكاء اصطناعي واحدة على الأقل.
de: Aktivieren Sie mindestens einen KI-Dienst.
en: Enable at least one AI service.
es: Habilite al menos un servicio de IA.
fr: Activez au moins un service IA.
ja: 少なくとも 1 つの AI サービスを有効にしてください。
ko: AI 서비스를 하나 이상 활성화하세요.
pt: Habilite pelo menos um serviço de IA.
ru: Включите хотя бы одну службу ИИ.
tr: En az bir yapay zekâ servisini etkinleştirin.
zh_hant: 至少啟用一個 AI 服務。

# settings.error.promptValidationFormat
source: %@：提示词必须包含 {{text}}。
ar: %@: يجب أن يحتوي التوجيه على {{text}}.
de: %@: Der Prompt muss {{text}} enthalten.
en: %@: prompt must contain {{text}}.
es: %@: el prompt debe contener {{text}}.
fr: %@ : le prompt doit contenir {{text}}.
ja: %@: プロンプトには {{text}} が含まれている必要があります。
ko: %@: 프롬프트에는 {{text}}가 포함되어야 합니다.
pt: %@: o prompt deve conter {{text}}.
ru: %@: промпт должен содержать {{text}}.
tr: %@: İstem, {{text}} içermelidir.
zh_hant: %@：提示詞必須包含 {{text}}。

# settings.provider.fallbackName
source: AI 服务
ar: خدمة الذكاء الاصطناعي
de: KI-Dienst
en: AI Service
es: Servicio de IA
fr: Service IA
ja: AIサービス
ko: AI 서비스
pt: Serviço de IA
ru: Служба ИИ
tr: Yapay Zekâ Servisi
zh_hant: AI 服務

# settings.prompt.fallbackName
source: 处理模板
ar: التوجيه
de: Prompt
en: Prompt
es: Prompt
fr: Prompt
ja: プロンプト
ko: 프롬프트
pt: Prompt
ru: Промпт
tr: İstem
zh_hant: 處理模板

# provider.defaultName
source: AI 服务
ar: خدمة الذكاء الاصطناعي
de: KI-Dienst
en: AI Service
es: Servicio de IA
fr: Service IA
ja: AIサービス
ko: AI 서비스
pt: Serviço de IA
ru: Служба ИИ
tr: Yapay Zekâ Servisi
zh_hant: AI 服務

# providerProfile.error.blankName
source: 服务名称不能为空。
ar: لا يمكن ترك اسم الخدمة فارغًا.
de: Der Dienstname darf nicht leer sein.
en: Service name cannot be empty.
es: El nombre del servicio no puede estar vacío.
fr: Le nom du service ne peut pas être vide.
ja: サービス名を空にすることはできません。
ko: 서비스 이름은 비워둘 수 없습니다.
pt: O nome do serviço não pode ficar vazio.
ru: Имя службы не может быть пустым.
tr: Servis adı boş olamaz.
zh_hant: 服務名稱不能為空。

# openAIConfiguration.error.blankBaseURL
source: Base URL 不能为空。
ar: لا يمكن أن تكون Base URL فارغة.
de: Die Basis-URL darf nicht leer sein.
en: Base URL cannot be empty.
es: La URL base no puede estar vacía.
fr: L’URL de base ne peut pas être vide.
ja: Base URL を空にすることはできません。
ko: Base URL은 비워둘 수 없습니다.
pt: A URL base não pode ficar vazia.
ru: Базовый URL не может быть пустым.
tr: Temel URL boş olamaz.
zh_hant: Base URL 不能為空。

# openAIConfiguration.error.invalidBaseURL
source: Base URL 无效。
ar: Base URL غير صالحة.
de: Die Basis-URL ist ungültig.
en: Base URL is invalid.
es: La URL base no es válida.
fr: L’URL de base n’est pas valide.
ja: Base URL が無効です。
ko: Base URL이 잘못되었습니다.
pt: A URL base é inválida.
ru: Базовый URL недействителен.
tr: Temel URL geçersiz.
zh_hant: Base URL 無效。

# openAIConfiguration.error.blankModel
source: 模型不能为空。
ar: لا يمكن ترك النموذج فارغًا.
de: Das Modell darf nicht leer sein.
en: Model cannot be empty.
es: El modelo no puede estar vacío.
fr: Le modèle ne peut pas être vide.
ja: モデルを空にすることはできません。
ko: 모델은 비워둘 수 없습니다.
pt: O modelo não pode ficar vazio.
ru: Модель не может быть пустой.
tr: Model boş olamaz.
zh_hant: 模型不能為空。

# openAIClient.providerTitle
source: AI 助手
ar: مساعد الذكاء الاصطناعي
de: KI-Assistent
en: AI Assistant
es: Asistente de IA
fr: Assistant IA
ja: AIアシスタント
ko: AI 어시스턴트
pt: Assistente de IA
ru: ИИ-ассистент
tr: Yapay Zekâ Asistanı

# openAIClient.error.requestFailed
source: 请求失败，请稍后重试
ar: فشل الطلب، يرجى المحاولة مرة أخرى لاحقًا.
de: Anfrage fehlgeschlagen, bitte versuchen Sie es später erneut.
en: Request failed. Please try again later.
es: La solicitud falló. Vuelva a intentarlo más tarde.
fr: La demande a échoué, veuillez réessayer plus tard.
ja: リクエストは失敗しました。後でもう一度試してください。
ko: 요청이 실패했습니다. 나중에 다시 시도해 주세요.
pt: Falha na solicitação. Tente novamente mais tarde.
ru: Не удалось выполнить запрос. Повторите попытку позже.
tr: İstek başarısız oldu; lütfen daha sonra yeniden deneyin.
zh_hant: 請求失敗，請稍後重試

# openAIClient.error.unauthorized
source: API Key 无效或无权限
ar: مفتاح API غير صالح أو غير مصرح به.
de: Der API-Schlüssel ist ungültig oder nicht autorisiert.
en: API key is invalid or unauthorized.
es: La clave API no es válida o no está autorizada.
fr: La clé API est invalide ou non autorisée.
ja: API キーが無効か、必要な権限がありません。
ko: API 키가 잘못되었거나 승인되지 않았습니다.
pt: A chave de API é inválida ou não autorizada.
ru: Ключ API недействителен или неавторизован.
tr: API anahtarı geçersiz veya yetkisiz.
zh_hant: API Key 無效或無權限

# openAIClient.error.emptyResponse
source: 响应为空
ar: الاستجابة فارغة.
de: Die Antwort ist leer.
en: Response is empty.
es: La respuesta está vacía.
fr: La réponse est vide.
ja: 応答が空です。
ko: 응답이 비어 있습니다.
pt: A resposta está vazia.
ru: Ответ пустой.
tr: Yanıt boş.
zh_hant: 回應為空

# openAIClient.error.parseFailed
source: 无法解析处理结果
ar: فشل في تحليل النتيجة.
de: Das Ergebnis konnte nicht analysiert werden.
en: Failed to parse the result.
es: No se pudo analizar el resultado.
fr: Échec de l'analyse du résultat.
ja: 結果の解析に失敗しました。
ko: 결과를 구문 분석하지 못했습니다.
pt: Falha ao analisar o resultado.
ru: Не удалось проанализировать результат.
tr: Sonuç ayrıştırılamadı.
zh_hant: 無法解析處理結果

# prompt.error.missingTextPlaceholder
source: 提示词必须包含 {{text}}。
ar: يجب أن يحتوي التوجيه على {{text}}.
de: Der Prompt muss {{text}} enthalten.
en: Prompt must contain {{text}}.
es: El prompt debe contener {{text}}.
fr: Le prompt doit contenir {{text}}.
ja: プロンプトには {{text}} が含まれている必要があります。
ko: 프롬프트에는 {{text}}가 포함되어야 합니다.
pt: O prompt deve conter {{text}}.
ru: Промпт должен содержать {{text}}.
tr: İstem, {{text}} içermelidir.
zh_hant: 提示詞必須包含 {{text}}。

# prompt.default.translate.name
source: 翻译
ar: ترجمة
de: Übersetzen
en: Translate
es: Traducir
fr: Traduire
ja: 翻訳
ko: 번역
pt: Traduzir
ru: Перевести
tr: Çevir
zh_hant: 翻譯

# prompt.default.translate.template
source: 请将下面的文本翻译为另一种语言：若原文是中文则译为英文，否则译为简体中文，只返回译文。 {{text}}
ar: ترجم النص التالي إلى اللغة الأخرى: إذا كان النص الأصلي بالصينية، فترجمه إلى الإنجليزية؛ وإلا فترجمه إلى الصينية المبسطة. أعد الترجمة فقط. {{text}}
de: Übersetze den folgenden Text in die andere Sprache: Wenn der Ausgangstext Chinesisch ist, übersetze ihn ins Englische; andernfalls ins vereinfachte Chinesisch. Gib nur die Übersetzung zurück. {{text}}
en: Translate the following text into the other language: if the source is Chinese, translate it into English; otherwise translate it into Simplified Chinese. Return only the translation. {{text}}
es: Traduce el siguiente texto al otro idioma: si el original está en chino, tradúcelo al inglés; de lo contrario, tradúcelo al chino simplificado. Devuelve solo la traducción. {{text}}
fr: Traduisez le texte suivant dans l’autre langue : si le texte source est en chinois, traduisez-le en anglais ; sinon, traduisez-le en chinois simplifié. Renvoyez uniquement la traduction. {{text}}
ja: 次の文章を別の言語に翻訳してください。原文が中国語の場合は英語に、それ以外の場合は簡体字中国語に翻訳してください。翻訳結果のみを返してください。 {{text}}
ko: 다음 텍스트를 다른 언어로 번역하세요. 원문이 중국어이면 영어로, 그 외에는 중국어 간체로 번역하세요. 번역문만 반환하세요. {{text}}
pt: Traduza o seguinte texto para o outro idioma: se o original estiver em chinês, traduza para o inglês; caso contrário, traduza para o chinês simplificado. Retorne apenas a tradução. {{text}}
ru: Переведите следующий текст на другой язык: если исходный текст на китайском, переведите его на английский; в остальных случаях — на упрощённый китайский. Верните только перевод. {{text}}
tr: Aşağıdaki metni diğer dile çevir: Metin Türkçeyse İngilizceye, değilse Türkçeye çevir. Yalnızca çeviriyi döndür. {{text}}
zh_hant: 請將下面的文字翻譯為另一種語言：若原文是中文則譯為英文，否則譯為簡體中文，只回傳譯文。 {{text}}

# prompt.default.translate.systemPrompt
source: 你是一名专业的翻译助手。
ar: أنت مساعد ترجمة محترف.
de: Sie sind ein professioneller Übersetzungsassistent.
en: You are a professional translation assistant.
es: Eres un asistente de traducción profesional.
fr: Vous êtes un assistant de traduction professionnel.
ja: あなたはプロの翻訳アシスタントです。
ko: 당신은 전문 번역 보조원입니다.
pt: Você é um assistente de tradução profissional.
ru: Вы — профессиональный помощник по переводу.
tr: Sen profesyonel bir çeviri asistanısın.
zh_hant: 你是一名專業的翻譯助手。

# prompt.default.summarize.name
source: 总结
ar: تلخيص
de: Zusammenfassen
en: Summarize
es: Resumir
fr: Résumer
ja: 要約
ko: 요약
pt: Resumir
ru: Кратко изложить
tr: Özetle
zh_hant: 摘要

# prompt.default.summarize.template
source: 请用简洁的语言总结下面的文本要点。 {{text}}
ar: لخّص النقاط الرئيسية في النص التالي بإيجاز. {{text}}
de: Fasse die wichtigsten Punkte des folgenden Textes kurz zusammen. {{text}}
en: Summarize the key points of the following text concisely. {{text}}
es: Resume de forma concisa los puntos clave del siguiente texto. {{text}}
fr: Résumez brièvement les points essentiels du texte suivant. {{text}}
ja: 次の文章の要点を簡潔にまとめてください。 {{text}}
ko: 다음 텍스트의 핵심 내용을 간결하게 요약하세요. {{text}}
pt: Resuma de forma concisa os pontos principais do seguinte texto. {{text}}
ru: Кратко изложите основные мысли следующего текста. {{text}}
tr: Aşağıdaki metnin ana noktalarını kısa ve öz şekilde özetle. {{text}}
zh_hant: 請用簡潔的語言總結下面的文字要點。 {{text}}

# prompt.default.summarize.systemPrompt
source: 你是一名擅长提炼要点的助手。
ar: أنت مساعد ماهر في استخلاص النقاط الرئيسية.
de: Sie sind ein Assistent, der darin geübt ist, die wichtigsten Punkte herauszuarbeiten.
en: You are an assistant skilled at distilling key points.
es: Eres un asistente experto en extraer los puntos clave.
fr: Vous êtes un assistant habile à distiller les points clés.
ja: あなたは重要なポイントを抽出することに熟練したアシスタントです。
ko: 당신은 핵심을 정리하는 데 능숙한 보조자입니다.
pt: Você é um assistente especializado em extrair os pontos principais.
ru: Вы — помощник, умеющий выделять ключевые моменты.
tr: Sen ana noktaları çıkarmada uzman bir asistansın.
zh_hant: 你是一名擅長提煉重點的助手。

# prompt.default.polish.name
source: 润色
ar: تحسين الصياغة
de: Text verbessern
en: Polish
es: Mejorar redacción
fr: Améliorer le style
ja: 文章を推敲
ko: 문장 다듬기
pt: Aprimorar texto
ru: Улучшить текст
tr: İyileştir
zh_hant: 潤飾

# prompt.default.polish.template
source: 请润色下面的文本，使其表达更清晰、更自然，保持原意不变。 {{text}}
ar: حسّن صياغة النص التالي ليصبح أوضح وأكثر سلاسة مع الحفاظ على المعنى الأصلي. {{text}}
de: Überarbeite den folgenden Text, damit er klarer und natürlicher klingt, ohne seine ursprüngliche Bedeutung zu verändern. {{text}}
en: Polish the following text to make it clearer and more natural while preserving the original meaning. {{text}}
es: Mejora la redacción del siguiente texto para que sea más claro y natural, conservando el significado original. {{text}}
fr: Améliorez le style du texte suivant pour le rendre plus clair et naturel tout en préservant le sens original. {{text}}
ja: 元の意味を保ちながら、次の文章をより明確で自然な表現に推敲してください。 {{text}}
ko: 원래 의미를 유지하면서 다음 텍스트를 더 명확하고 자연스럽게 다듬으세요. {{text}}
pt: Aprimore o seguinte texto para torná-lo mais claro e natural, preservando o significado original. {{text}}
ru: Отредактируйте следующий текст, сделав его более ясным и естественным и сохранив исходный смысл. {{text}}
tr: Aşağıdaki metni, özgün anlamını koruyarak daha açık ve daha doğal hale getir. {{text}}
zh_hant: 請潤飾下面的文字，使其表達更清晰、更自然，保持原意不變。 {{text}}

# prompt.default.polish.systemPrompt
source: 你是一名专业的文字编辑。
ar: أنت محرر نصوص محترف.
de: Sie sind ein professioneller Lektor.
en: You are a professional copy editor.
es: Eres un editor de textos profesional.
fr: Vous êtes un correcteur professionnel.
ja: あなたはプロの文章編集者です。
ko: 당신은 전문적인 편집자이십니다.
pt: Você é um editor profissional.
ru: Вы — профессиональный редактор текста.
tr: Sen profesyonel bir metin editörüsün.
zh_hant: 你是一名專業的文字編輯。

# prompt.newDefaultName
source: 新模板 %d
ar: توجيه جديد %d
de: Neuer Prompt %d
en: New Prompt %d
es: Nuevo prompt %d
fr: Nouveau prompt %d
ja: 新規プロンプト %d
ko: 새 프롬프트 %d
pt: Novo prompt %d
ru: Новый промпт %d
tr: Yeni İstem %d

# shortcut.prompt.descriptionFormat
source: 用「%@」处理当前选中文本。
ar: قم بمعالجة التحديد الحالي باستخدام "%@".
de: Aktuelle Auswahl mit „%@“ verarbeiten.
en: Process the current selection with "%@".
es: Procese la selección actual con "%@".
fr: Traiter la sélection en cours avec "%@".
ja: 現在の選択範囲を「%@」で処理します。
ko: ‘%@’을(를) 사용하여 현재 선택한 텍스트를 처리합니다.
pt: Processe a seleção atual com "%@".
ru: Обработать выделенный текст с помощью «%@».
tr: Geçerli seçimi “%@” ile işle.
zh_hant: 用「%@」處理目前選取的文字。

# shortcut.prompt.clipboardDescriptionFormat
source: 用「%@」处理选中文本，未选中时使用剪贴板。
ar: قم بمعالجة النص المحدد باستخدام "%@"، أو استخدم الحافظة في حالة عدم العثور على أي تحديد.
de: Ausgewählten Text mit „%@“ verarbeiten oder die Zwischenablage verwenden, wenn keine Auswahl vorliegt.
en: Process selected text with "%@", or use the clipboard when no selection is found.
es: Procese el texto seleccionado con "%@" o use el portapapeles cuando no se encuentre ninguna selección.
fr: Traitez le texte sélectionné avec "%@", ou utilisez le presse-papiers lorsqu’aucune sélection n’est trouvée.
ja: 選択したテキストを「%@」で処理するか、選択範囲が見つからない場合はクリップボードを使用します。
ko: ‘%@’ 프롬프트로 선택한 텍스트를 처리하며, 선택한 텍스트가 없으면 클립보드를 사용합니다.
pt: Processe o texto selecionado com "%@" ou use a área de transferência quando nenhuma seleção for encontrada.
ru: Обработать выделенный текст с помощью «%@» или использовать буфер обмена, если выделение не найдено.
tr: Seçili metni “%@” ile işle; seçim bulunamazsa panoyu kullan.
zh_hant: 用「%@」處理選取的文字，未選取時使用剪貼簿。

# panel.header.title
source: AI 助手
ar: مساعد الذكاء الاصطناعي
de: KI-Assistent
en: AI Assistant
es: Asistente de IA
fr: Assistant IA
ja: AIアシスタント
ko: AI 어시스턴트
pt: Assistente de IA
ru: ИИ-ассистент
tr: Yapay Zekâ Asistanı

# panel.subtitle.shortcutPaused
source: 快捷键已暂停
ar: تم إيقاف الاختصارات مؤقتًا
de: Tastenkombinationen sind pausiert
en: Shortcuts are paused
es: Los atajos de teclado están en pausa
fr: Les raccourcis sont en pause
ja: ショートカットが一時停止されています
ko: 단축키가 일시 중지되었습니다.
pt: Os atalhos estão pausados
ru: Сочетания клавиш приостановлены
tr: Kısayollar duraklatıldı
zh_hant: 快速鍵已暫停

# panel.subtitle.permissionRequired
source: 启用前需要辅助功能授权
ar: يلزم منح إذن تسهيلات الاستخدام
de: Berechtigung für Bedienungshilfen erforderlich
en: Accessibility permission is required
es: Se requiere permiso de accesibilidad
fr: Une autorisation d'accessibilité est requise
ja: アクセシビリティ権限が必要です
ko: 손쉬운 사용 권한이 필요합니다.
pt: É necessária permissão de acessibilidade
ru: Требуется разрешение на универсальный доступ
tr: Erişilebilirlik izni gerekli
zh_hant: 啟用前需要輔助使用權限

# panel.subtitle.needsProvider
source: 需要配置 AI 服务
ar: قم بتكوين خدمة الذكاء الاصطناعي أولاً
de: Zuerst einen KI-Dienst konfigurieren
en: Configure an AI service first
es: Configure primero un servicio de IA
fr: Configurer d'abord un service IA
ja: 先に AI サービスを設定してください
ko: 먼저 AI 서비스를 구성하세요
pt: Configure primeiro um serviço de IA
ru: Сначала настройте службу ИИ
tr: Önce bir yapay zekâ servisi yapılandırın
zh_hant: 需要設定 AI 服務

# panel.subtitle.ready
source: 按下模板快捷键处理选中文本
ar: اضغط على اختصار أحد التوجيهات لمعالجة النص المحدد
de: Tastenkombination für Prompt drücken, um ausgewählten Text zu verarbeiten
en: Press a prompt shortcut to process selected text
es: Pulsa el atajo de teclado de un prompt para procesar el texto seleccionado
fr: Appuyez sur un raccourci de prompt pour traiter le texte sélectionné
ja: プロンプトのショートカットを押して、選択したテキストを処理します
ko: 선택한 텍스트를 처리하려면 프롬프트 단축키를 누르세요.
pt: Pressione um atalho de prompt para processar o texto selecionado
ru: Нажмите сочетание клавиш промпта, чтобы обработать выделенный текст
tr: Seçili metni işlemek için bir istem kısayoluna basın
zh_hant: 按下模板快速鍵處理選取的文字
